Ran Plan for dir: `first` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_instance.first_ec2 will be created
+ resource "aws_instance" "first_ec2" {
      + ami                                  = "ami-0522ab6e1ddcc7055"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jenkins_key_pair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "ec-21"
        }
      + tags_all                             = {
          + "Name" = "ec-21"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.db.aws_dynamodb_table.backendDb will be destroyed
  # (because aws_dynamodb_table.backendDb is not in configuration)
- resource "aws_dynamodb_table" "backendDb" {
      - arn                         = "arn:aws:dynamodb:ap-south-1:730335217239:table/backendtabel" -> null
      - billing_mode                = "PAY_PER_REQUEST" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "LockID" -> null
      - id                          = "backendtabel" -> null
      - name                        = "backendtabel" -> null
      - read_capacity               = 0 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 0 -> null
        # (3 unchanged attributes hidden)

      - attribute {
          - name = "LockID" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled        = false -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.s3_calling.aws_s3_bucket.s3_terraform will be destroyed
  # (because aws_s3_bucket.s3_terraform is not in configuration)
- resource "aws_s3_bucket" "s3_terraform" {
      - arn                         = "arn:aws:s3:::terraform-s3-bucket-new1996" -> null
      - bucket                      = "terraform-s3-bucket-new1996" -> null
      - bucket_domain_name          = "terraform-s3-bucket-new1996.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "terraform-s3-bucket-new1996.s3.ap-south-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z11RGJOFQNVJUP" -> null
      - id                          = "terraform-s3-bucket-new1996" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-south-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "t_s3"
        } -> null
      - tags_all                    = {
          - "Name" = "t_s3"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "4aeeefbcf42599d60536aa4b6c4c8b052f3b7cc983361111f84a8e6a90ff6a49" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3_calling.aws_s3_bucket_server_side_encryption_configuration.encryption will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.encryption is not in configuration)
- resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {
      - bucket                = "terraform-s3-bucket-new1996" -> null
      - id                    = "terraform-s3-bucket-new1996" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3_calling.aws_s3_bucket_versioning.terra_version will be destroyed
  # (because aws_s3_bucket_versioning.terra_version is not in configuration)
- resource "aws_s3_bucket_versioning" "terra_version" {
      - bucket                = "terraform-s3-bucket-new1996" -> null
      - id                    = "terraform-s3-bucket-new1996" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Enabled" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 4 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d first
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://1c8463912d40:4141/lock?id=Harshitha-1996%252Fatlanties%252Ffirst%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d first
  ```
Plan: 1 to add, 0 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```